# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
# Your code here
import sqlite3
import pandas as pd
import numpy as np
con = sqlite3.connect('data.sqlite')

## Employees and their Office (a One-to-One join)

Return a DataFrame with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [10]:
# Your code here
pd.read_sql_query('''
SELECT e.firstName, e.lastName, o.city, o.state
FROM employees e
LEFT JOIN offices o
USING (officeCode)
ORDER BY e.firstName, e.lastName
''', con).head()

  firstName lastName           city state
0      Andy   Fixter         Sydney
1   Anthony      Bow  San Francisco    CA
2     Barry    Jones         London
3     Diane   Murphy  San Francisco    CA
4  Foon Yue    Tseng            NYC    NY

## Customers and their Orders (a One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [13]:
# Your code here
pd.read_sql_query('''
SELECT c.contactFirstName, c.contactLastName, o.orderNumber, o.orderDate, o.status
FROM customers c
LEFT JOIN orders o
USING (customerNumber)
ORDER BY c.contactFirstName
''', con)

    contactFirstName  contactLastName  orderNumber   orderDate      status
0             Adrian           Huxley      10139.0  2003-07-16     Shipped
1             Adrian           Huxley      10270.0  2004-07-19     Shipped
2             Adrian           Huxley      10361.0  2004-12-17     Shipped
3             Adrian           Huxley      10420.0  2005-05-29  In Process
4              Akiko        Shimamura      10258.0  2004-06-15     Shipped
..               ...              ...          ...         ...         ...
345           Yoshi            Tamuri      10206.0  2003-12-05     Shipped
346           Yoshi            Tamuri      10313.0  2004-10-22     Shipped
347               Yu             Choi      10242.0  2004-04-20     Shipped
348               Yu             Choi      10319.0  2004-11-03     Shipped
349         Zbyszek   Piestrzeniewicz          NaN        None        None

[350 rows x 5 columns]

## Customers and their Payments (another One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [15]:
# Your code here
pd.read_sql_query('''
SELECT c.contactFirstName, c.contactLastName, p.amount, p.paymentDate
FROM customers c
LEFT JOIN payments p
USING (customerNumber)
ORDER BY p.amount DESC
''', con)

    contactFirstName contactLastName     amount paymentDate
0             Diego           Freyre  120166.58  2005-03-18
1             Diego           Freyre  116208.40  2004-12-31
2              Susan          Nelson  111654.40  2003-08-15
3               Eric       Natividad  105743.00  2003-12-26
4              Susan          Nelson  101244.59  2005-03-05
..               ...             ...        ...         ...
292            Sven          Ottlieb        NaN        None
293           Carmen           Anton        NaN        None
294           Hanna             Moos        NaN        None
295       Alexander          Semenov        NaN        None
296           Raanan     Altagar,G M        NaN        None

[297 rows x 4 columns]

## Orders, Order details, and Product Details (a Many-to-Many Join)

Return a DataFrame with all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [ ]:
# Your code here
pd.read_sql_query('''
SELECT c.contactFirstName, c.contactLastName, p.amount, od.quantityOrdered, 
FROM customers c
LEFT JOIN payments p
USING (customerNumber)
ORDER BY p.amount DESC
''', con)

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!